app/controllers/geo_lines_controller.rb

SELECT "geo_lines".* FROM "geo_lines"
---
  def index
    @geo_lines = GeoLine.all

INSERT INTO "geo_lines" ("created_at", "delay", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 04 Mar 2013 09:51:26 UTC +00:00], ["delay", 2000], ["name", nil], ["updated_at", Mon, 04 Mar 2013 09:51:26 UTC +00:00]]
---
  def create
    respond_to do |format|
      format.js  { @geo = GeoLine.create params[:geo_line] }

SELECT "geo_lines".* FROM "geo_lines" WHERE "geo_lines"."id" = ? LIMIT 1  [["id", "1"]]
SELECT lat, lon FROM "geo_points" WHERE "geo_points"."geo_line_id" = 89 AND (created_at >= '2013-03-28 12:48:40.034903' AND created_at <= '2013-03-28 12:49:40.034903')
---
  def show
    @geo_line = GeoLine.find params[:id]
    @@x = @@x || @geo_line.geo_points.first.created_at