app/controllers/geo_points_controller.rb

INSERT INTO "geo_points" ("created_at", "geo_line_id", "lat", "lon", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 03 Mar 2013 11:38:35 UTC +00:00], ["geo_line_id", nil], ["lat", nil], ["lon", nil], ["updated_at", Sun, 03 Mar 2013 11:38:35 UTC +00:00]]
SELECT COUNT(*) FROM "geo_points" WHERE "geo_points"."geo_line_id" = 57
---
  def create
    geo_point = GeoPoint.create params[:geo_point]
    respond_to do |format|
      format.html { redirect_to root_path}
      format.js {@geo_points_count = geo_point.geo_line.geo_points.count}