app/controllers/geos_controller.rb

INSERT INTO "geos" ("created_at", "lat", "lon", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sun, 03 Feb 2013 09:51:58 UTC +00:00], ["lat", "55.794941"], ["lon", "49.105044"], ["updated_at", Sun, 03 Feb 2013 09:51:58 UTC +00:00]]
---
  def create
    Geo.create params[:geo]

SELECT "geos".* FROM "geos" WHERE "geos"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    @geo = Geo.find params[:id]

SELECT "geos".* FROM "geos"
---
  def index
    @geos = Geo.all